config/cf/Catalogs/TelegramКлавиатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>TelegramКлавиатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Авторазмер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКлавиатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TelegramВидКлавиатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьПослеИспользования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Кнопки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Строка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>URL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>callback_data</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/TelegramВидКлавиатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>TelegramВидКлавиатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Встроенная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Программная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкрытьКлавиатуру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/TelegramКлавиатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Если Объект.Ссылка.Пустая() Тогда
    	Объект.ВидКлавиатуры = Перечисления.TelegramВидКлавиатуры.Стандартная;
	КонецЕсли;
	
	Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	ОбновитьВидимостьДоступность();
    
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Алгоритм = ТекущийОбъект.Алгоритм.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Алгоритм = Новый ХранилищеЗначения(Алгоритм, Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидКлавиатурыПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьДоступность()
	
	Если Объект.ВидКлавиатуры = Перечисления.TelegramВидКлавиатуры.СкрытьКлавиатуру Тогда
	    Элементы.Страницы.Видимость = Ложь;
	ИначеЕсли Объект.ВидКлавиатуры = Перечисления.TelegramВидКлавиатуры.Программная Тогда
		Элементы.Страницы.Видимость = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКод;
	ИначеЕсли Объект.ВидКлавиатуры = Перечисления.TelegramВидКлавиатуры.Стандартная Тогда
		Элементы.Страницы.Видимость = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКнопки;
		Элементы.КнопкиURL.Видимость = Ложь;
		Элементы.Кнопкиcallback_data.Видимость = Ложь;
	ИначеЕсли Объект.ВидКлавиатуры = Перечисления.TelegramВидКлавиатуры.Встроенная Тогда
		Элементы.Страницы.Видимость = Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКнопки;
		Элементы.КнопкиURL.Видимость = Истина;
		Элементы.Кнопкиcallback_data.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияКлавиатуры(Команда)
	
	Модифицированность = Истина;
	Алгоритм = Алгоритм + Символы.ПС 
		+ 	"Клавиатура = Новый Структура();
			|МассивСтрок = Новый Массив();";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКнопку(Команда)
	
	Модифицированность = Истина;
	Алгоритм = Алгоритм + Символы.ПС
		+ "МассивКнопокСтроки = Новый Массив();
		|// Добавляем кнопку.
		|Кнопка = Новый Структура;
		|Кнопка.Вставить(""text"", ""Текст на кнопке"");
		|Кнопка.Вставить(""url"", ""URL, который откроется при нажатии на кнопку"");
		|Кнопка.Вставить(""callback_data"", ""Данные, которые будут отправлены в callback_query при нажатии на кнопку"");
		|МассивКнопокСтроки.Добавить(Кнопка);
		|// ... 			
		|МассивСтрок.Добавить(МассивКнопокСтроки);";
	
КонецПроцедуры

&НаКлиенте
Процедура АвторазмерКлавиатуры(Команда)
	
	Модифицированность = Истина;
	Алгоритм = Алгоритм + Символы.ПС + "Клавиатура.Вставить(""resize_keyboard"", Истина);";
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПослеИспользования(Команда)
	
	Модифицированность = Истина;
	Алгоритм = Алгоритм + Символы.ПС + "Клавиатура.Вставить(""one_time_keyboard"", Истина);";
	
КонецПроцедуры

&НаКлиенте
Процедура КлавиатураГотова(Команда)
	
	Модифицированность = Истина;
	Алгоритм = Алгоритм + Символы.ПС 
		+ "Клавиатура.Вставить(""keyboard"", МассивСтрок); // вместо keyboard можно использовать inline_keyboard";
	
КонецПроцедуры

#КонецОбласти
